STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_Find_Bind_OnOff_Router1/STM32_WPAN/App/app_zigbee.c
  if (zigbee_app_info.zb == NULL) {
    APP_DBG("Error, zigbee stack not initialized");
    return;
  }

  /* Check if the router joined the network */
  if (ZbNwkGet(zigbee_app_info.zb, ZB_NWK_NIB_ID_ExtendedPanId, &epid, sizeof(epid)) != ZB_STATUS_SUCCESS) {
    APP_DBG("Error, failed to get network information");
    return;
  }
  if (epid == 0U) {
    APP_DBG("Error, device not on a network");
    return;
  }

  req.dst = *ZbApsAddrBinding;
  req.groupId = SW1_GROUP_ADDR;
  req.sceneId = SW1_SCENE_ID;
  APP_DBG("SW1 PUSHED (Send Store Scene Command)");
  status = zcl_scenes_client_store_req(zigbee_app_info.scenes_client, &req, NULL, NULL);
  if (status != ZCL_STATUS_SUCCESS) {
    APP_DBG("ERROR, failed to send Store Scenes Command");
  }
}

/**
 * @brief  Button 2 handler. Sends a recall scene command via binding if device is on a network.
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_SW2_Process()
{
  uint8_t status = ZCL_STATUS_FAILURE;
  uint64_t epid = 0U;
  struct zcl_scenes_recall_request_t req;

  if (zigbee_app_info.zb == NULL) {
    APP_DBG("Error, zigbee stack not initialized");
    return;
  }

  /* Check if the router joined the network */
  if (ZbNwkGet(zigbee_app_info.zb, ZB_NWK_NIB_ID_ExtendedPanId, &epid, sizeof(epid)) != ZB_STATUS_SUCCESS) {
    APP_DBG("Error, failed to get network information");
    return;
  }
  if (epid == 0U) {
    APP_DBG("Error, device not on a network");
    return;
  }
  APP_DBG("SW2 PUSHED (Send Recall Scene Command)");
  req.dst = *ZbApsAddrBinding;
  req.groupId = SW1_GROUP_ADDR;
  req.sceneId = SW1_SCENE_ID;
  req.transition = 0;
  status = zcl_scenes_client_recall_req(zigbee_app_info.scenes_client, &req, NULL, NULL);
  if (status != ZCL_STATUS_SUCCESS) {
    APP_DBG("ERROR, failed to send Recall Scenes Command");
  }
}

/**
 * @brief  Button 3 handler. Sends an onOff toggle command via binding if device is on a network.
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_SW3_Process()
{
  uint8_t status = ZCL_STATUS_FAILURE;
  uint64_t epid = 0U;
  struct ZbApsAddrT dst = *ZbApsAddrBinding;

  if (zigbee_app_info.zb == NULL) {
    APP_DBG("Error, zigbee stack not initialized");
    return;
  }

  /* Check if the router joined the network */
  if (ZbNwkGet(zigbee_app_info.zb, ZB_NWK_NIB_ID_ExtendedPanId, &epid, sizeof(epid)) != ZB_STATUS_SUCCESS) {
    APP_DBG("Error, failed to get network information");
    return;
  }
  if (epid == 0U) {
    APP_DBG("Error, device not on a network");
    return;
  }
  APP_DBG("SW3 PUSHED (Send OnOff Toggle Command)");
  status = ZbZclOnOffClientToggleReq(zigbee_app_info.onoff_client, &dst, NULL, NULL);
  if (status != ZCL_STATUS_SUCCESS) {
    APP_DBG("ERROR, failed to send OnOff Toggle Command");
  }
}

/**
 * @brief  Checks the number of valid entries in the binding table.
 * @param  None
 * @retval Number of bindings
 */
static int numOfBindings()
{
  uint8_t i, num_entries = 0;
  struct ZbApsmeBindT entry;

  for (i = 0;; i++) {
      if (ZbApsGetIndex(zigbee_app_info.zb, ZB_APS_IB_ID_BINDING_TABLE, &entry, sizeof(entry), i) != ZB_APS_STATUS_SUCCESS) {
          break;
      }
      if (entry.srcExtAddr == 0ULL) {
          continue;
      }
      num_entries++;
  }
  return num_entries;
}

/* USER CODE END FD_LOCAL_FUNCTIONS */



